### Terraform Plan — `dev`

| Step | Status |
|------|--------|
| Format | ✅ |
| Initialize | ✅ |
| Validate | ✅ |
| Plan | ✅ |


<details><summary>📋 Plan Output</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_application_insights.appi has been deleted
  - resource "azurerm_application_insights" "appi" {
      - connection_string                     = (sensitive value) -> null
        id                                    = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.Insights/components/kingsila-app-appi-93133"
      - instrumentation_key                   = (sensitive value) -> null
        name                                  = "kingsila-app-appi-93133"
        tags                                  = {}
        # (14 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.law has been deleted
  - resource "azurerm_log_analytics_workspace" "law" {
      - id                                      = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.OperationalInsights/workspaces/kingsila-app-law-93133" -> null
        name                                    = "kingsila-app-law-93133"
        tags                                    = {}
        # (16 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev"
      - name       = "rg-kingsila-dev" -> null
        tags       = {
            "environment" = "dev"
            "owner"       = "KingSila"
            "project"     = "CloudPortfolio"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_service_plan.plan has been deleted
  - resource "azurerm_service_plan" "plan" {
      - id                              = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.Web/serverFarms/kingsila-app-asp" -> null
        name                            = "kingsila-app-asp"
        tags                            = {}
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.appi will be created
  + resource "azurerm_application_insights" "appi" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "westeurope"
      + name                                = "kingsila-app-appi-93133"
      + resource_group_name                 = "rg-kingsila-dev"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # azurerm_linux_web_app.web will be created
  + resource "azurerm_linux_web_app" "web" {
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "kingsila-app-web"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-kingsila-dev"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version = "8.0"
            }
        }
    }

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "westeurope"
      + name                            = "kingsila-app-law-93133"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-kingsila-dev"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-kingsila-dev"
      + tags     = {
          + "environment" = "dev"
          + "owner"       = "KingSila"
          + "project"     = "CloudPortfolio"
        }
    }

  # azurerm_service_plan.plan will be created
  + resource "azurerm_service_plan" "plan" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "westeurope"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "kingsila-app-asp"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-kingsila-dev"
      + sku_name                        = "B1"
      + worker_count                    = (known after apply)
    }

  # azurerm_subnet.appsvc will be created
  + resource "azurerm_subnet" "appsvc" {
      + address_prefixes                              = [
          + "10.10.20.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-appsvc"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-kingsila-dev"
      + virtual_network_name                          = "vnet-kingsila-dev"

      + delegation {
          + name = "appservice"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.nsg_app.azurerm_network_security_group.this will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nsg-app-dev"
      + resource_group_name = "rg-kingsila-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "dev"
          + "owner"       = "KingSila"
          + "project"     = "CloudPortfolio"
        }
    }

  # module.nsg_app.azurerm_network_security_rule.allow_rdp will be created
  + resource "azurerm_network_security_rule" "allow_rdp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-RDP"
      + network_security_group_name = "nsg-app-dev"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-kingsila-dev"
      + source_address_prefix       = "192.168.18.3/32"
      + source_port_range           = "*"
    }

  # module.nsg_app.azurerm_network_security_rule.allow_ssh will be created
  + resource "azurerm_network_security_rule" "allow_ssh" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Allow-SSH"
      + network_security_group_name = "nsg-app-dev"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-kingsila-dev"
      + source_address_prefix       = "192.168.18.3/32"
      + source_port_range           = "*"
    }

  # module.nsg_app.azurerm_subnet_network_security_group_association.assoc["app"] will be created
  + resource "azurerm_subnet_network_security_group_association" "assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.nsg_app.azurerm_subnet_network_security_group_association.assoc["data"] will be created
  + resource "azurerm_subnet_network_security_group_association" "assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.route_table.azurerm_route.internet_route will be created
  + resource "azurerm_route" "internet_route" {
      + address_prefix      = "0.0.0.0/0"
      + id                  = (known after apply)
      + name                = "InternetRoute"
      + next_hop_type       = "Internet"
      + resource_group_name = "rg-kingsila-dev"
      + route_table_name    = "dev-route-table"
    }

  # module.route_table.azurerm_route_table.this will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "dev-route-table"
      + resource_group_name           = "rg-kingsila-dev"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "environment" = "dev"
          + "owner"       = "KingSila"
          + "project"     = "CloudPortfolio"
        }
    }

  # module.route_table.azurerm_subnet_route_table_association.assoc["app"] will be created
  + resource "azurerm_subnet_route_table_association" "assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_table.azurerm_subnet_route_table_association.assoc["data"] will be created
  + resource "azurerm_subnet_route_table_association" "assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vnet.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-kingsila-dev"
    }

  # module.vnet.azurerm_subnet.subnets["app"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.10.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "app"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-kingsila-dev"
      + virtual_network_name                          = "vnet-kingsila-dev"
    }

  # module.vnet.azurerm_subnet.subnets["data"] will be created
  + resource "azurerm_subnet" "subnets" {
      + address_prefixes                              = [
          + "10.10.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "data"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-kingsila-dev"
      + virtual_network_name                          = "vnet-kingsila-dev"
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.10.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "vnet-kingsila-dev"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-kingsila-dev"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "dev"
          + "owner"       = "KingSila"
          + "project"     = "CloudPortfolio"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ appinsights_connection_string   = (sensitive value)
  ~ appinsights_instrumentation_key = (sensitive value)
  ~ law_id                          = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.OperationalInsights/workspaces/kingsila-app-law-93133" -> (known after apply)
  + webapp_url                      = (known after apply)

```

</details>

_Commit: a45a4b9f10b53a3292a374b6efefc2cca5f31786_